Функция ВыходныеИПраздники (КалендарнаяДата, ЕРВ, КРД, КРЧ, НаименованиеГрафика) Экспорт
//Возвращает значение = 0, если КалендарнаяДата приходится на Сб, Вс и Праздник
//Возвращает значение = 1, если это рабочий день
//Возвращает значение = КРЧ, если это рабочий день в часах
Если ЕРВ = Перечисления.ЕдиницаРабочегоВремени.День И 
	//Определим рабочее время
ДеньНедели (КалендарнаяДата) < (КРД + 1) тогда
Значение = "Выходной";
ИначеЕсли ЕРВ = Перечисления.ЕдиницаРабочегоВремени.Час И
ДеньНедели (КалендарнаяДата) < (КРД + 1) тогда
Значение = КРЧ;
//Определим Сб, Вс
Иначе 
Значение = "Рабочий День";
КонецЕсли;
//Добавим нерабочее время праздников
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Праздники.Дата КАК Дата
		|ИЗ
		|	Справочник.Праздники КАК Праздники";
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Праздник = ВыборкаДетальныеЗаписи.Дата;
		Если КалендарнаяДата = Праздник Тогда
		Значение = "Праздник";
	КонецЕсли; 
	
КонецЦикла;

Возврат Значение;

КонецФункции
	