&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	ПустаяДата = Дата(1,1,1);
	Если ДатаНач <> ПустаяДата И ДатаКон <> ПустаяДата Тогда
		ЗаполнитьГрафикНаСервере();
	Иначе
		Сообщить("Не заполнен или неправильно заполнен период графика");
	КонецЕсли
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьГрафикНаСервере()
	//Создать справочник - объект
РеквизитФормыВЗначение ("Объект").ЗаполнитьГрафик(ДатаНач, ДатаКон);
КонецПроцедуры 





  &НаКлиенте
Процедура ОчиститьГрафик(Команда)
	ОчиститьГрафикНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьГрафикНаСервере()
	НаборЗаписей = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей(); 

НаборЗаписей.Записать();
Сообщить("График Очищен");
КонецПроцедуры
