Процедура ЗаполнитьГрафик(ДатаНач, ДатаКон) Экспорт
	НаименованиеГрафика = Наименование;
Сутки = 24*60*60;
КалендарнаяДата = НачалоДня(ДатаНач); //начало графика
КонецПериода = КонецДня(ДатаКон); //конец графика
//создание набора записей соответсвующего графика
Набор = СоздатьНаборЗаписей();
//в цикле создаем записи в регистре сведений ГрафикиРаботы
Пока КалендарнаяДата <= КонецПериода Цикл
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.Дата = КалендарнаяДата;
	НоваяЗапись.ГрафикРаботы = Ссылка;
	ЕРВ = ЕдиницаРабочегоВремени;
	КРД = КоличествоРабочихДнейВНеделе;
	КРЧ = КоличествоРабочихЧасов;
	//определить рабочее и нерабочее время
	Значение = РасчетыНаСервере.Выходныеипраздники(КалендарнаяДата, ЕРВ, КРД, КРЧ, НаименованиеГрафика);
	НоваяЗапись.Значение = Значение;
	КалендарнаяДата = КалендарнаяДата + Сутки;
	Набор.Записать();
КонецЦикла;
КонецПроцедуры

Функция СоздатьНаборЗаписей()
	Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.ГрафикРаботы.Установить (Ссылка);
	Набор.Очистить();
	Возврат Набор;
КонецФункции

Функция ОчиститьНаборЗаписей()
	Набор = РегистрыСведений.ГрафикиРаботы.ОчиститьНаборЗаписей();
	Набор.Отбор.ГрафикРаботы.Установить (Ссылка);
	Набор.Очистить();
	Возврат Набор;
КонецФункции