
&НаКлиенте
Процедура Сформировать(Команда)
	Серверная();
КонецПроцедуры    

&НаСервере
Процедура Серверная()
	
	МРасчетнаяВедомость = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МРасчетнаяВедомость");
	//Получить объект из макета
	MSWord = МРасчетнаяВедомость.Получить();  
	ДатаСоставления = Формат(ТекущаяДата(), "ДЛФ=D");
		Попытка
		Документ = MSWord.Application.Documents(1);
		Документ.Activate();
		//Получить объект, который используется для поиска и замен
		Замена = Документ.Content.Find;
		//Заменить заранее определенные ключевые инструкции на требуемый текст
		Замена.Execute("<Sop>",Ложь, Истина, Ложь, , , Истина, , Ложь, "" + ОтчетныйПериодС + ""); 
		Замена = Документ.Content.Find;
		Замена.Execute("<Poop>",Ложь, Истина, Ложь, , , Истина, , Ложь, "" + ОтчетныйПериодПо + "");
		Замена = Документ.Content.Find;
		Замена.Execute("<Okod>",Ложь, Истина, Ложь, , , Истина, , Ложь, "" + ФормаПоОКУД + "");    
		Замена = Документ.Content.Find;
		Замена.Execute("<Nomd>",Ложь, Истина, Ложь, , , Истина, , Ложь, "" + НомерДокумента + "");
		Замена = Документ.Content.Find;
		Замена.Execute("<Datesost>",Ложь, Истина, Ложь, , , Истина, , Ложь, "" + ДатаСоставления + "");

		//Начало вывода табличной части в Word
		//Закладка (-1 позиция начало ввода перед закладкой 
		MSWord.ActiveWindow.Selection.GoTo(-1, , ,"TablChast");
		Для Каждого ТекСтр ИЗ ТаблЗнач Цикл
			ТабельныйНомер1 = СокрЛП(ТекСтр.ТабельныйНомер);
			ФИО1 = СокрЛП(ТекСтр.ФИО); 
			Должность1 = СокрЛП(ТекСтр.Должность);
			Оклад1 = СокрЛП(ТекСтр.Оклад);
			ОтработаноЧасов1 = СокрЛП(ТекСтр.ОтработаноЧасов);
			НачисленоВсего1 = СокрЛП(ТекСтр.НачисленоВсего);
			УдержаноНДФЛ1 = СокрЛП(ТекСтр.УдержаноНДФЛ);
			СуммаКВыплате1 = СокрЛП(ТекСтр.СуммаКВыплате);
			MSWord.ActiveWindow.Selection.TypeText(ТабельныйНомер1);
			MSWord.ActiveWindow.Selection.TypeText(ФИО1);    
			MSWord.ActiveWindow.Selection.TypeText(Должность1);
            MSWord.ActiveWindow.Selection.TypeText(Оклад1);
			MSWord.ActiveWindow.Selection.TypeText(ОтработаноЧасов1);
			MSWord.ActiveWindow.Selection.TypeText(НачисленоВсего1);
			MSWord.ActiveWindow.Selection.TypeText(УдержаноНДФЛ1);
			MSWord.ActiveWindow.Selection.TypeText(СуммаКВыплате1);
			MSWord.ActiveWindow.Selection.TypeParagraph(); //Переход на следующую строку
			КонецЦикла;		
		
		//Делаем видимым приложение и активизируем его
		MSWord.Application.Visible = Истина;
		MSWord.Activate();
	Исключение
		//Если произойдет ошибка, вводятся данные об ошибке и объект закрывается
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		MSWord.Application.Quit();
	КонецПопытки;
		
КонецПроцедуры
