&НаКлиенте
Процедура Сформировать(Команда)
	Серверная();
КонецПроцедуры   

&НаСервере
Процедура Серверная()
	
	Справка	 = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Справка");
	//Получить объект из макета
	MSWord = Справка.Получить();  
		Попытка
		Документ = MSWord.Application.Documents(1);
		Документ.Activate();
		//Получить объект, который используется для поиска и замен
		Замена = Документ.Content.Find;
		//Заменить заранее определенные ключевые инструкции на требуемый текст
		Замена.Execute("<FIO>",Ложь, Истина, Ложь, , , Истина, , Ложь, "" + ФИО + ""); 
		Замена = Документ.Content.Find;
		Замена.Execute("<DIAGNOZ>",Ложь, Истина, Ложь, , , Истина, , Ложь, "" + Диагноз + "");
		Замена = Документ.Content.Find;
		Замена.Execute("<DAYLIFE>",Ложь, Истина, Ложь, , , Истина, , Ложь, "" + ДатаРождения + "");
		
				
		//Делаем видимым приложение и активизируем его
		MSWord.Application.Visible = Истина;
		MSWord.Activate();
	Исключение
		//Если произойдет ошибка, вводятся данные об ошибке и объект закрывается
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		MSWord.Application.Quit();
	КонецПопытки;
		
КонецПроцедуры
